/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   dup_fd_and_close.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ksharlen <ksharlen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/10 11:42:17 by mdelphia          #+#    #+#             */
/*   Updated: 2020/02/29 20:38:23 by ksharlen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "exec.h"
// для дублирования дескрипторов
int		dup_fd_and_close(int fd, int dup_fd)
{
	if (fd != dup_fd)
	{
		if (dup2(fd, dup_fd) < 0)
			return (1);
		close(fd);
	}
	return (0);
}
